numerical_calc/lapack_codes/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<title>固有値ベクトルJacobi, Lapack(dgesv)関連コード</title>
<!-- 2018-10-22 月 13:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="cc by Shigeto R. Nishitani, Kwansei Gakuin Univ., 2018" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">固有値ベクトルJacobi, Lapack(dgesv)関連コード</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Maple</a></li>
<li><a href="#sec-2">2. rubyの注</a></li>
<li><a href="#sec-3">3. Jacobi回転による固有値を求めるCコード</a></li>
<li><a href="#sec-4">4. 西谷謹製lazy逆行列計算プログラム</a></li>
<li><a href="#sec-5">5. LAPACK謹製smart逆行列計算プログラム</a>
<ul>
<li><a href="#sec-5-1">5.1. リスト: ヤコビ法の計算結果．</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Maple</h2>
<div class="outline-text-2" id="text-1">
<p>
$A$を対称正方行列，$x$をベクトルとしたときに，
$$
Ax = \lambda x
$$
の解，$&lambda;$を固有値，$x$を固有ベクトルという．$x$がゼロベクトルではない意味のある解は特性方程式det$(A-&lambda; E)=0$が成り立つときにのみ得られる．
</p>

<p>
まず特性方程式を解いてみる．
</p>

<div class="org-src-container">

<pre class="src src-maple">&gt; restart;
&gt; with(LinearAlgebra):with(plots):with(plottools):
&gt; A:=Matrix(1..2,1..2,[[3,2/3],[2/3,2]]);
</pre>
</div>

<p>
$$
A\, := \, \left[ \begin {array}{cc} 3&2/3\\2/3&2\end {array} \right]
$$
</p>

<div class="org-src-container">

<pre class="src src-maple">&gt; EE:=Matrix([[1,0],[0,1]]):
&gt;  A-lambda.EE;
&gt; eq2:=Determinant(A-lambda.EE);
</pre>
</div>

<p>
$$
 {\it eq2}\, := \,{\frac {50}{9}}-5\,\lambda+{\lambda}^{2}
$$
</p>

<pre class="example">
&gt; solve(eq2=0,lambda);
</pre>
<p>
$$
10/3,\,5/3
$$
</p>

<div class="org-src-container">

<pre class="src src-maple">&gt; lambda,V:=Eigenvectors(A);
</pre>
</div>

<p>
$$
\lambda,\,V\, := \, \left[ \begin {array}{c} 10/3\\5/3\end {array} \right] ,\, \left[ \begin {array}{cc} 2&-1/2\\1&1\end {array} \right] 
$$
</p>

<p>
固有値を求めるコマンドEigenvectorsを適用すると，固有値と固有ベクトルが求まる．ここで，固有ベクトルは行列の列(Column)ベクトルに入っている．
</p>
<div class="org-src-container">

<pre class="src src-maple">&gt; lambda,V:=Eigenvectors(A);
</pre>
</div>
<p>
$$
\lambda,\,V\, := \, \left[ \begin {array}{c} 10/3\\5/3\end {array} \right] ,\, \left[ \begin {array}{cc} 2&-1/2\\1&1\end {array} \right] 
$$
得られた固有ベクトルは規格化されているわけではない．
</p>

<p>
行列の列を取り出すコマンドColumnを用いて，方程式(\ref{Eq:Eigen})が成り立っていることを確認する．
</p>
<pre class="example">
&gt; lambda[1].Column(V,1)=A.Column(V,1);
</pre>
<p>
$$
\left[ \begin {array}{c} 20/3\\
10/3\end {array} \right] = 
\left[ \begin {array}{c} 20/3\\
10/3\end {array} \right] 
$$
一般的な規格化は，コマンドNormalize(vector,Euclidean)によっておこなう．
</p>
<div class="org-src-container">

<pre class="src src-maple">&gt; Normalize(Column(v,1),Euclidean);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> rubyの注</h2>
<div class="outline-text-2" id="text-2">
<p>
ちなみにrubyでは[SciRuby](<a href="https://github.com/SciRuby/nmatrix/wiki/Getting-started">https://github.com/SciRuby/nmatrix/wiki/Getting-started</a>)
に従ってnmatrixをinstallして，
</p>
<div class="org-src-container">

<pre class="src src-ruby">require 'nmatrix'
require 'time'

#n = NMatrix.new(3, [4,9,2,3,5,7,8,1,6], dtype: :float64)
[1000,2000,4000].each do |size|
  n = size
  aa = NMatrix.random([n,n+1])
  start = Time.now
  lu = aa.factorize_lu
  p Time.now - start
end
</pre>
</div>

<p>
素直に走らせると，
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">size</td>
<td class="right">nmatrix[sec]</td>
<td class="right">nmaxtrix/lapacke</td>
</tr>

<tr>
<td class="right">:----</td>
<td class="right">&#x2013;&#x2014;:</td>
<td class="right">&#x2013;&#x2014;:</td>
</tr>

<tr>
<td class="right">1000</td>
<td class="right">0.2118</td>
<td class="right">0.028607</td>
</tr>

<tr>
<td class="right">2000</td>
<td class="right">1.9287</td>
<td class="right">0.191315</td>
</tr>

<tr>
<td class="right">4000</td>
<td class="right">16.9059</td>
<td class="right">1.313174</td>
</tr>
</tbody>
</table>

<p>
のnmatrixです．2017/10/28現在nmatrix-0.2.4です．
やっぱ，Rubyは数値計算苦手なんかと諦めかけたんですが，
</p>

<pre class="example">
gem install nmatrix nmatrix-lapacke
</pre>

<p>
して
</p>
<div class="org-src-container">

<pre class="src src-ruby">Require 'nmatrix/lapacke'
</pre>
</div>

<p>
すると前表のnmatrix/lapacke欄です．これだと，C版に遜色ないですね．
nmatrix-lapacke-0.2.3がinstallされています．
このあたりの解説が[sciruby](<a href="http://sciruby.com/nmatrix/">http://sciruby.com/nmatrix/</a>)以外見当たらなくて．．．
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Jacobi回転による固有値を求めるCコード</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="c_versions/Jacobi2.c">c_versions/Jacobi2.c</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 西谷謹製lazy逆行列計算プログラム</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="c_versions/bob.c">c_versions/bob.c</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> LAPACK謹製smart逆行列計算プログラム</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="c_versions/lapack.c">c_versions/lapack.c</a>
</li>
</ul>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> リスト: ヤコビ法の計算結果．</h3>
<div class="outline-text-3" id="text-5-1">
<pre class="example">
[BobsNewPBG4:~/NumRecipe/chap8] bob% cat input.txt
4
5 4 1 1
4 5 1 1
1 1 4 2
1 1 2 4

BobsNewPBG4:~/NumRecipe/chap8] bob% Jacobi2&lt;input.txt
  5.00  4.00  1.00  1.00
  4.00  5.00  1.00  1.00
  1.00  1.00  4.00  2.00
  1.00  1.00  2.00  4.00

p,q=  1,  2
  9.00 -0.00  1.41  1.41
 -0.00  1.00 -0.00 -0.00
  1.41 -0.00  4.00  2.00
  1.41 -0.00  2.00  4.00

p,q=  1,  3
  9.37 -0.00 -0.00  1.88
 -0.00  1.00  0.00 -0.00
 -0.00  0.00  3.63  1.57
  1.88 -0.00  1.57  4.00

p,q=  1,  4
  9.96 -0.00  0.47 -0.00
 -0.00  1.00  0.00  0.00
  0.47  0.00  3.63  1.50
  0.00  0.00  1.50  3.41

...&lt;中略&gt;...

Eigen values:
 10.00  1.00  5.00  2.00
Eigen vectors:
  0.63 -0.71 -0.32  0.00
  0.63  0.71 -0.32  0.00
  0.32  0.00  0.63 -0.71
  0.32  0.00  0.63  0.71
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: cc by Shigeto R. Nishitani, Kwansei Gakuin Univ., 2018</p>
<p class="date">Created: 2018-10-22 月 13:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
